/*
 *                   ___====-_  _-====___
 *             _--^^^#####//      \\#####^^^--_
 *          _-^##########// (    ) \\##########^-_
 *         -############//  |\^^/|  \\############-
 *       _/############//   (@::@)   \############\_
 *      /#############((     \\//     ))#############\
 *     -###############\\    (oo)    //###############-
 *    -#################\\  / VV \  //#################-
 *   -###################\\/      \//###################-
 *  _#/|##########/\######(   /\   )######/\##########|\#_
 *  |/ |#/\#/\#/\/  \#/\##\  |  |  /##/\#/  \/\#/\#/\#| \|
 *  `  |/  V  V  `   V  \#\| |  | |/#/  V   '  V  V  \|  '
 *     `   `  `      `   / | |  | | \   '      '  '   '
 *                      (  | |  | |  )
 *                     __\ | |  | | /__
 *                    (vvv(VVV)(VVV)vvv)
 * 
 *      ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * 
 *                神兽保佑            永无BUG
 * 
 * @Author: Eugene Hung
 * @Date: 2020-10-21 10:38:54
 * @LastEditors: Eugene Hung
 * @LastEditTime: 2020-11-12 15:43:17
 * @FilePath: \Test\eugene_test.c
 */

#include "eugene_test.h"

int main()
{
    unsigned int a[17] = {0};
    //FILE *file;
    while (1)
    {
        scanf("%x", &a[0]);

        printf(" %d \n", a[0]);
/*         for(int i=0;i<17;i++)
        {
        scanf("%x", &a[i]);
        a[i] = a[i] - 1;
        a[i] = ~a[i];
        a[i] = a[i] / 60;
        printf(" %d \n", a[i]);
        }

        file = fopen("C:\\Users\\Eugene Hung\\Desktop\\volume.txt", "r+");
        if (file == NULL)
        {
            printf("read error");
        }
        else
        {
            for(int i=0;i<17;i++)
            {
            fprintf(file, " - %d dB \n",a[i]);
            }
            break;
        }
        fclose(file); */
    }
}
